DeviceTvmSecureConfigurationAssessment
| join kind=leftouter (
    DeviceTvmSecureConfigurationAssessmentKB
    | project ConfigurationId, ConfigurationName, ConfigurationDescription, RiskDescription, Tags, ConfigurationImpact
) on ConfigurationId
| summarize any(*) by ConfigurationId
| project ConfigurationId, any_ConfigurationName, any_ConfigurationCategory, any_ConfigurationSubcategory, any_ConfigurationDescription, any_RiskDescription
//| where any_ConfigurationSubcategory contains "Antivirus" and any_ConfigurationName != ""
